load-test-baseline.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 120
      arrivalRate: 10
      name: "Baseline - 10 users for 2 minutes"
  defaults:
    headers:
      Content-Type: "application/json"
  variables:
    adminEmail: "superadmin@library.com"
    adminPassword: "admin123"

scenarios:
  - name: "Admin Login & Profile Workflow"
    flow:
      - post:
          url: "/api/v1/admin/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            json: "$.data.accessToken"
            as: "adminToken"
      - think: 2
      - get:
          url: "/api/v1/admin/profile"
          headers:
            Authorization: "Bearer {{ adminToken }}"
      - think: 1

  - name: "Student List & Details Workflow"
    flow:
      - post:
          url: "/api/v1/admin/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            json: "$.data.accessToken"
            as: "token"
      - get:
          url: "/api/v1/students"
          headers:
            Authorization: "Bearer {{ token }}"
          query: "page=1&limit=20"
          capture:
            json: "$.data[0]._id"
            as: "studentId"
      - think: 1
      - get:
          url: "/api/v1/students/{{ studentId }}"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1

  - name: "Slot Operations Workflow"
    flow:
      - post:
          url: "/api/v1/admin/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            json: "$.data.accessToken"
            as: "token"
      - get:
          url: "/api/v1/slots"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data[0]._id"
            as: "slotId"
      - think: 1
      - get:
          url: "/api/v1/slots/{{ slotId }}"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1