load-test-rampup.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Ramp-up start - 1 user"
    - duration: 540
      arrivalRate: 1
      rampTo: 50
      name: "Ramp-up - 1 to 50 users over 9 minutes"
    - duration: 120
      arrivalRate: 50
      name: "Sustained - 50 users for 2 minutes"
  defaults:
    headers:
      Content-Type: "application/json"
  variables:
    adminEmail: "superadmin@library.com"
    adminPassword: "admin123"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Mixed API Workflow"
    weight: 60
    flow:
      - post:
          url: "/api/v1/admin/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            json: "$.data.accessToken"
            as: "token"
      - think: 1
      - get:
          url: "/api/v1/students?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/v1/slots"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2

  - name: "Admin Dashboard"
    weight: 40
    flow:
      - post:
          url: "/api/v1/admin/login"
          json:
            email: "{{ adminEmail }}"
            password: "{{ adminPassword }}"
          capture:
            json: "$.data.accessToken"
            as: "token"
      - think: 1
      - get:
          url: "/api/v1/admin/profile"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/v1/students?status=ACTIVE&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2